/*****************************************************************************
*  C++ 图像算法
*  Copyright (C) 2020 1158292387@qq.com
*
*  @file
*  @brief    对文件的简单概述
*  Details.
*
*  @author   Leeme
*  @email    1158292387@qq.com
*  @version  1.0.0.1(版本)
*  @date     2020.11.21
*  @license  GNU General Public License (GPL)
*
*----------------------------------------------------------------------------
*  Remark         : Description
*----------------------------------------------------------------------------
*  Change History :
*  <Date>     | <Version> | <Author>       | <Description>
*----------------------------------------------------------------------------
*  2020/10/30 | 1.0.0.1   | Leeme          | Create file
*----------------------------------------------------------------------------
*
*****************************************************************************/
#pragma once

#include "imagealg.h"
#include <vector>

namespace HT
{
	/**
	* @brief 简单概述
	* @brief 计算某个点是否在图像内部
	*/
	
};